In [ ]:
<a href="https://colab.research.google.com/github/joseeden/joeden/blob/master/docs/021-Software-Engineering/021-Jupyter-Notebooks/022-Exploring-NYC-Public-School-Test-Result-Scores/Exploring-NYC-Public-School-Test-Result-Scores.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exploring NYC Public School Test Result Scores

In [ ]:
<center><img src="schoolbus.jpg"></center>

<!-- ![New York City schoolbus](schoolbus.jpg) -->

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

- **Which NYC schools have the best math results?**:  
  
    - Schools with at least 80% of the max math score (â‰¥640).  
    - Save as `best_math_schools` with `school_name` and `average_math`.
    - Sort the results by "average_math" (descending).  

- **What are the top 10 performing schools based on the combined SAT scores?**:  
  
    - Sum math, reading, and writing scores as `total_SAT`.  
    - Save results in a Datafram called `top_10_schools`.
    - Result should contain columns `school_name` and `total_SAT`
    - Sort results by `total_SAT` (descending).  

- **Which single borough has the largest standard deviation in the combined SAT score?**:  

    - Find the borough with the largest standard deviation in `total_SAT`.  
    - Save results in Dataframe called `largest_std_dev`, with columns:  
      - `borough` (name)  
      - `num_schools` (count)  
      - `average_SAT` (mean of "total_SAT")  
      - `std_SAT` (standard deviation of "total_SAT")  
    - Round all numbers to two decimal places.

In [ ]:
import pandas as pd

url = 'https://raw.githubusercontent.com/joseeden/joeden/refs/heads/master/docs/021-Software-Engineering/021-Jupyter-Notebooks/022-Exploring-NYC-Public-School-Test-Result-Scores/schools.csv'  

schools = pd.read_csv(url)
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [42]:
best_math_schools = (
    schools[["school_name", "average_math"]]
    .loc[schools.average_math > 640]
    .sort_values("average_math", ascending=False)
)

best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

In [43]:
schools["total_SAT"] = (
    schools[["average_math", "average_reading", "average_writing"]]
    .sum(axis=1)
)

top_10_schools = schools[["school_name", "total_SAT"]].nlargest(10, "total_SAT")

schools['num_schools'] = (
    schools.groupby('borough')['borough']
    .transform('count')
)

schools['average_SAT'] = (
    schools.groupby('total_SAT')['total_SAT']
    .transform('mean')
    .round(2)
)

boroughs = (
    schools.groupby("borough")["total_SAT"]
    .agg(["count", "mean", "std"])
    .round(2)
    .reset_index()
)

largest_std_dev = (
    boroughs[boroughs["std"] == boroughs["std"].max()]
    .set_index("borough")
)

largest_std_dev = largest_std_dev.rename(
    columns={"count": "num_schools", "mean": "average_SAT", "std": "std_SAT"}
)

largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29